#include "m2.h"

#include "common.h"
#include "mpq.h"

#include <stdlib.h>
#include <string.h>

struct wow_m2_track_base_int
{
	/* 0x00 */ uint16_t interpolation_type;
	/* 0x02 */ int16_t global_sequence;
	/* 0x04 */ struct wow_m2_array interpolation_ranges;
	/* 0x0C */ struct wow_m2_array timestamps;
};

struct wow_m2_track_int
{
	/* 0x00 */ struct wow_m2_track_base_int base;
	/* 0x14 */ struct wow_m2_array values;
};

struct wow_m2_camera_int
{
	/* 0x00 */ uint32_t type;
	/* 0x04 */ float fov;
	/* 0x08 */ float far_clip;
	/* 0x0C */ float near_clip;
	/* 0x10 */ struct wow_m2_track_int position;
	/* 0x2C */ struct wow_vec3f position_base;
	/* 0x38 */ struct wow_m2_track_int target_position;
	/* 0x54 */ struct wow_vec3f target_position_base;
	/* 0x60 */ struct wow_m2_track_int roll;
};

struct wow_m2_event_int
{
	/* 0x00 */ uint32_t identifier;
	/* 0x04 */ uint32_t data;
	/* 0x08 */ uint32_t bone;
	/* 0x0C */ struct wow_vec3f position;
	/* 0x18 */ struct wow_m2_track_base_int enabled;
};

struct wow_m2_skin_profile_int
{
	/* 0x00 */ struct wow_m2_array vertexes;  /* uint16_t */
	/* 0x08 */ struct wow_m2_array indices;   /* uint16_t */
	/* 0x10 */ struct wow_m2_array bones;     /* uint32_t */
	/* 0x18 */ struct wow_m2_array sections;  /* struct wow_m2_skin_section */
	/* 0x20 */ struct wow_m2_array batches;   /* struct wow_m2_batch */
	/* 0x28 */ uint32_t bone_count_max;
};

struct wow_m2_ribbon_int
{
	/* 0x00 */ uint32_t ribbon_id;
	/* 0x04 */ uint32_t bone_index;
	/* 0x08 */ struct wow_vec3f position;
	/* 0x14 */ struct wow_m2_array texture_indices;   /* uint16_t */
	/* 0x1C */ struct wow_m2_array material_indices;  /* uint16_t */
	/* 0x24 */ struct wow_m2_track_int color;         /* struct wow_vec3f */
	/* 0x40 */ struct wow_m2_track_int alpha;         /* int16_t */
	/* 0x5C */ struct wow_m2_track_int height_above;  /* float */
	/* 0x78 */ struct wow_m2_track_int height_below;  /* float */
	/* 0x94 */ float edges_per_second;
	/* 0x98 */ float edge_lifetime;
	/* 0x9C */ float gravity;
	/* 0xA0 */ uint16_t texture_rows;
	/* 0xA2 */ uint16_t texture_cols;
	/* 0xA4 */ struct wow_m2_track_int tex_slot;      /* uint16_t */
	/* 0xC0 */ struct wow_m2_track_int visibility;    /* uint8_t */
};

struct wow_m2_bone_int
{
	/* 0x00 */ int32_t key_bone_id;
	/* 0x04 */ uint32_t flags;
	/* 0x08 */ int16_t parent_bone;
	/* 0x0A */ uint16_t submesh_id;
	/* 0x0C */ uint32_t bone_name_crc;
	/* 0x10 */ struct wow_m2_track_int translation; /* struct wow_vec3f */
	/* 0x2C */ struct wow_m2_track_int rotation;    /* struct wow_quats */
	/* 0x48 */ struct wow_m2_track_int scale;       /* struct wow_vec3f */
	/* 0x64 */ struct wow_vec3f pivot;
};

struct wow_m2_texture_weight_int
{
	/* 0x0 */ struct wow_m2_track_int weight; /* int16_t */
};

struct wow_m2_color_int
{
	/* 0x00 */ struct wow_m2_track_int color; /* struct wow_vec3f */
	/* 0x1C */ struct wow_m2_track_int alpha; /* int16_t */
};

struct wow_m2_light_int
{
	/* 0x00 */ uint16_t type;
	/* 0x02 */ int16_t bone;
	/* 0x04 */ struct wow_vec3f position;
	/* 0x10 */ struct wow_m2_track_int ambient_color;     /* struct wow_vec3f */
	/* 0x2C */ struct wow_m2_track_int ambient_intensity; /* float */
	/* 0x48 */ struct wow_m2_track_int diffuse_color;     /* struct wow_vec3f */
	/* 0x64 */ struct wow_m2_track_int diffuse_intensity; /* float */
	/* 0x80 */ struct wow_m2_track_int attenuation_start; /* float */
	/* 0x9C */ struct wow_m2_track_int attenuation_end;   /* float */
	/* 0xB8 */ struct wow_m2_track_int visibility;        /* uint8_t */
};

struct wow_m2_texture_int
{
	/* 0x0 */ uint32_t type;
	/* 0x4 */ uint32_t flags;
	/* 0x8 */ struct wow_m2_array filename;
};

struct wow_m2_texture_transform_int
{
	/* 0x00 */ struct wow_m2_track_int translation; /* struct wow_vec3f */
	/* 0x1C */ struct wow_m2_track_int rotation;    /* struct wow_quatf */
	/* 0x38 */ struct wow_m2_track_int scaling;     /* struct wow_vec3f */
};

struct wow_m2_attachment_int
{
	/* 0x00 */ uint32_t id;
	/* 0x04 */ uint16_t bone;
	/* 0x06 */ uint16_t unknown;
	/* 0x08 */ struct wow_vec3f position;
	/* 0x04 */ struct wow_m2_track_int animate_attached; /* uint8_t */
};

struct wow_m2_particle_int
{
	/* 0x000 */ uint32_t id;
	/* 0x004 */ uint32_t flags;
	/* 0x008 */ struct wow_vec3f position;
	/* 0x014 */ uint16_t bone;
	/* 0x016 */ uint16_t texture;
	/* 0x018 */ struct wow_m2_array geometry_model_filename;  /* char */
	/* 0x020 */ struct wow_m2_array recursion_model_filename; /* char */
	union
	{
		struct
		{
			/* 0x028 */ uint8_t blending_type2;
			/* 0x029 */ uint8_t emitter_type2;
			/* 0x02A */ uint16_t particle_color_index;
		};
		struct
		{
			/* 0x028 */ uint16_t blending_type;
			/* 0x02A */ uint16_t emitter_type;
		};
	};
	/* 0x02C */ uint8_t particle_type;
	/* 0x02D */ uint8_t head_or_tail;
	/* 0x02E */ int16_t texture_tile_rotation;
	/* 0x030 */ uint16_t texture_dimensions_rows;
	/* 0x032 */ uint16_t texture_dimensions_columns;
	/* 0x034 */ struct wow_m2_track_int emission_speed;       /* float */
	/* 0x050 */ struct wow_m2_track_int speed_variation;      /* float */
	/* 0x06C */ struct wow_m2_track_int vertical_range;       /* float */
	/* 0x088 */ struct wow_m2_track_int horizontal_range;     /* float */
	/* 0x0A4 */ struct wow_m2_track_int gravity;              /* float */
	/* 0x0C0 */ struct wow_m2_track_int lifespan;             /* float */
	/* 0x0DC */ struct wow_m2_track_int emission_rate;        /* float */
	/* 0x0F8 */ struct wow_m2_track_int emission_area_length; /* float */
	/* 0x114 */ struct wow_m2_track_int emission_area_width;  /* float */
	/* 0x130 */ struct wow_m2_track_int z_source;             /* float */
	/* 0x14C */ float mid_point;
	/* 0x150 */ struct wow_vec4b color_values[3];
	/* 0x15C */ float scale_values[3];
	/* 0x168 */ uint16_t lifespan_uv_anim[3];
	/* 0x16E */ uint16_t decay_uv_anim[3];
	/* 0x174 */ int16_t tail_uv_anim[2];
	/* 0x178 */ int16_t tail_decay_uv_anim[2];
	/* 0x17C */ float tail_length;
	/* 0x180 */ float twinkle_speed;
	/* 0x184 */ float twinkle_percent;
	/* 0x188 */ float twinkle_scale_min;
	/* 0x18C */ float twinkle_scale_max;
	/* 0x190 */ float burst_multiplier;
	/* 0x194 */ float drag;
	/* 0x198 */ float spin;
	/* 0x19C */ struct wow_m2_box tumble;
	/* 0x1B4 */ struct wow_vec3f wind_vector;
	/* 0x1C0 */ float wind_time;
	/* 0x1C4 */ float follow_speed1;
	/* 0x1C8 */ float follow_scale1;
	/* 0x1CC */ float follow_speed2;
	/* 0x1D0 */ float follow_scale2;
	/* 0x1D4 */ struct wow_m2_array spline_points;  /* struct wow_vec3f */
	/* 0x1DC */ struct wow_m2_track_int enabled_in; /* uint8_t */
};

static void *array_read(size_t data_size, uint32_t *elem_nb, struct wow_m2_array *array, struct wow_mpq_file *mpq)
{
	void *data = WOW_MALLOC(data_size * array->count);
	if (!data)
		return NULL;
	if (wow_mpq_seek(mpq, array->offset, SEEK_SET) == -1)
	{
		WOW_FREE(data);
		return NULL;
	}
	if (wow_mpq_read(mpq, data, data_size * array->count) != data_size * array->count)
	{
		WOW_FREE(data);
		return NULL;
	}
	if (elem_nb)
		*elem_nb = array->count;
	return data;
}

static bool read_track(struct wow_m2_track *track, size_t data_size, struct wow_m2_track_int *track_int, struct wow_mpq_file *mpq)
{
	track->interpolation_type = track_int->base.interpolation_type;
	track->global_sequence = track_int->base.global_sequence;
	track->interpolation_ranges = array_read(sizeof(struct wow_m2_range), &track->interpolation_ranges_nb, &track_int->base.interpolation_ranges, mpq);
	if (!track->interpolation_ranges)
		return false;
